[
  "obsidian-git",
  "obsidian-admonition",
  "recent-files-obsidian",
  "table-editor-obsidian",
  "obsidian-day-planner",
  "obsidian-embedded-code-title",
  "find-unlinked-files",
  "darlal-switcher-plus",
  "obsidian-auto-link-title",
  "supercharged-links-obsidian",
  "obsidian-hider",
  "obsidian-style-settings",
  "ProxyGithub",
  "obsidian-outliner",
  "markdown-prettifier"
]