[
  "obsidian-git",
  "obsidian-admonition",
  "recent-files-obsidian",
  "table-editor-obsidian",
  "obsidian-day-planner",
  "obsidian-embedded-code-title",
  "find-unlinked-files",
  "obsidian-auto-link-title",
  "supercharged-links-obsidian",
  "obsidian-hider",
  "obsidian-outliner",
  "markdown-prettifier",
  "obsidian-another-quick-switcher",
  "obsidian-image-toolkit",
  "vim-im-select",
  "zoottelkeeper-obsidian-plugin",
  "obsidian-emoji-toolbar",
  "obsidian-gist"
]