[
  "obsidian-git",
  "obsidian-admonition",
  "table-editor-obsidian",
  "obsidian-day-planner",
  "obsidian-embedded-code-title",
  "obsidian-auto-link-title",
  "supercharged-links-obsidian",
  "markdown-prettifier",
  "obsidian-image-toolkit",
  "various-complements",
  "obsidian-another-quick-switcher",
  "vim-im-select",
  "zoottelkeeper-obsidian-plugin",
  "obsidian-style-settings",
  "quick-explorer",
  "obsidian-tasks-plugin",
  "homepage",
  "obsidian-hider",
  "obsidian-kanban",
  "statusbar-organizer",
  "settings-search",
  "obsidian-outliner",
  "codeblock-customizer",
  "obs-text-wrapper",
  "li-text-wrapper",
  "page-scroll",
  "obsidian-alias-from-heading",
  "insert-heading-link",
  "short-internal-links-to-headings",
  "quick-snippets-and-navigation",
  "obsidian-export-image",
  "obsidian-excalidraw-plugin",
  "obsidian-minimal-settings"
]