[
  "obsidian-git",
  "obsidian-admonition",
  "table-editor-obsidian",
  "obsidian-day-planner",
  "obsidian-embedded-code-title",
  "find-unlinked-files",
  "obsidian-auto-link-title",
  "supercharged-links-obsidian",
  "obsidian-outliner",
  "markdown-prettifier",
  "obsidian-image-toolkit",
  "various-complements",
  "obsidian-another-quick-switcher",
  "vim-im-select",
  "zoottelkeeper-obsidian-plugin",
  "obsidian-style-settings",
  "quick-explorer",
  "obsidian-tasks-plugin",
  "link-headers-directly",
  "homepage",
  "obsidian-hider",
  "omnisearch",
  "easy-typing-obsidian",
  "obsidian-minimal-settings",
  "obsidian-omnivore",
  "smart-connections",
  "obsidian-quiet-outline"
]