[
  "obsidian-git",
  "obsidian-admonition",
  "table-editor-obsidian",
  "obsidian-day-planner",
  "obsidian-embedded-code-title",
  "find-unlinked-files",
  "obsidian-auto-link-title",
  "supercharged-links-obsidian",
  "markdown-prettifier",
  "obsidian-image-toolkit",
  "various-complements",
  "obsidian-another-quick-switcher",
  "vim-im-select",
  "zoottelkeeper-obsidian-plugin",
  "obsidian-style-settings",
  "quick-explorer",
  "obsidian-tasks-plugin",
  "link-headers-directly",
  "homepage",
  "obsidian-hider",
  "obsidian-minimal-settings",
  "obsidian-quiet-outline",
  "obsidian-kanban",
  "statusbar-organizer",
  "new-tab-plus",
  "settings-search",
  "obsidian-outliner",
  "obsidian-export-image",
  "codeblock-customizer",
  "obs-text-wrapper"
]